---
type: IFCHybridImport
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 5
tags: [revit-api, class]
---

# IFCHybridImport

`Autodesk.Revit.DB.IFC.IFCHybridImport` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IFCHybridImport | 2024 | `public IFCHybridImport ()` |
| Method | CreateMap | — | `public IDictionary < IFCGuidKey , ElementId > CreateMap ( Document doc , IList < ElementId > elementIds )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | ImportElements | 2024 | `public IList < ElementId > ImportElements ( Document doc , string file )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |